    .data
array:  .word 3, 1, 8, 5, 2, 7, 4, 6, 10, 9  # 10 элементтэй массив
n:      .word 10                                # массивын элементийн тоо

    .text
    .globl main
main:
    la $t0, array       # массивын эхлэл хаягийг $t0 рүү онооно
    lw $t1, n           # массивын хэмжээг $t1 рүү онооно

    
    li $t2, 0           # $t2 = 0
outer_loop:
    li $t3, 0           # $t3 = 0
inner_loop:
    lw $t4, 0($t0)      # $t4 д хадгалагдсан элементийг уншиж ав
    lw $t5, 4($t0)      # $t5 д дараах элементийг уншиж ав

    bge $t4, $t5, skip_swap # Хоёр элементийг шалгана. Хэрэв тэдний утгууд эрэмбэгдсэн бол, swap хийхээ алгасна.
    # swap хийх
    sw $t4, 4($t0)      # дараах элементд $t4 утгыг оноо
    sw $t5, 0($t0)      # одоогийн элементд $t5 утгыг оноо

skip_swap:
    addi $t0, $t0, 4    # массивын дараах элемент рүү шилжих
    addi $t3, $t3, 1    # $t3 д тоог нэмэх
    bne $t3, $t1, inner_loop # хэмжээний дугаар дээр байна уу

    addi $t2, $t2, 1    # Дараах элемэнтийн хамгийн их утга байрлуулагдсан байна уу
    li $t3, 0           # тоо $t3 рүү 0 утгыг оноо
    sub $t1, $t1, 1     # массивын элементийн тоог нэмэх
    bne $t2, $t1, outer_loop # массивын бүх элементийн хамгийн их утга байрлуулагдсан байна уу


    li $v0, 10          
    syscall