.text          #командын санах ой энэ хэсэгт програмаа бичнэ
.globl main
main:          
      #main: (тэмдэгт хаяг) программын эхлэх хаяг =0x400000  

ori $8, $0, 17   # $8-д тогтмол утгуудыг хадгална
lui $9, 0x1000   # $9-д бааз хаяг хадгалах бөгөөд тогтмол 0x10000000 хаяг байна
lw $10, x    	 # санах ойд зарласан х-ийн утгыг $10-д ачаалах $10=0xb
sll $0, $0, 0    
sll $0, $0, 0  
#lw $16, address     #delay буюу nop команд
lb $11, y      #санах ойд зарласан у-ийн утгыг $11-д ачаалах $1=0x0000000b
#sll $0, $0, 0
#sll $0, $0, 0
multu $10, $11
mflo $12
multu $12, $8
mflo $12            #17ху=$12
ori $8, $0,12
multu $10, $8
mflo $13    #12х=$13
ori $8, $0,6
multu $11, $8
mflo $14    #6у=$14
subu $15, $12, $13    #17ху-12x=$15
subu $15, $15, $14     #17ху-12x-6y=$15
addiu $15, $15, 12    #17ху-12x-6y+12=$15
sw $15, 4($9)       #үр дүнг санах ойн 0x0000004 хаяганп хадлгалах
     
.data #өгөгдлийг санах ойн энэ хэсэгт өгөгдөл зарлана
#address: .word 0x10000000
x: .word 0xa #x: (тэмдэгт хаяг)=0x10000000, энэ хаяганд 0xb гэсэн өгөгдөл хадгалагдана
y: .word 0x2a #у: (тэмдэгт хаяг)=0x10000001, энэ хаяганд 0x5b гэсэн өгөгдөл хадгалагдана
# өгөгдөлийн төрлийг .byte эсвэл .word (4 byte) гэж зарлана.
# хэрэв у: .word 0x5b гэвэл 0x0000005b гэсэн 4 byte өгөгдөл санах ойд хадгалагдана.
	
    	

li $v0,10
syscall